## Proyecto Final

pip install pandas as pd
pip install numpy as np
pip install pandas pyodbc

In [1]:
# Carga de librerias
import pandas as pd 
import numpy as np
import pyodbc
import os

## Inicio de revisión, filtrado de datos y limpieza de los mismos(ETL).

In [2]:
#Se realiza la carga de librerias nuevamente en caso que no haya tomado 
import pandas as pd
import numpy as np

## ETL archivo 2017PurchasePicesDec

In [3]:
# Ruta del archivo CSV (ajusta según la ubicación de tu archivo)
ruta_csv1 = r"C:\\Proyecto Final Henry\\DataBase\\2017PurchasePricesDec.csv"

In [4]:
# Cargar el CSV en un DataFrame de Pandas
df1 = pd.read_csv(ruta_csv1)

In [5]:
# Mostrar las primeras filas del CSV
df1.head()

,Brand,Description,Price,Size,Volume,Classification,PurchasePrice,VendorNumber,VendorName
0,58,Gekkeikan Black & Gold Sake,12.99,750mL,750,1,9.28,8320,SHAW ROSS INT L IMP LTD
1,62,Herradura Silver Tequila,36.99,750mL,750,1,28.67,1128,BROWN-FORMAN CORP
2,63,Herradura Reposado Tequila,38.99,750mL,750,1,30.46,1128,BROWN-FORMAN CORP
3,72,No. 3 London Dry Gin,34.99,750mL,750,1,26.11,9165,ULTRA BEVERAGE COMPANY LLP
4,75,Three Olives Tomato Vodka,14.99,750mL,750,1,10.94,7245,PROXIMO SPIRITS INC.

In [6]:
num_unique_brands1 = df1['Brand'].nunique()
print(num_unique_brands1)

12261

In [7]:
#Revisar total de filas y columnas del archivo CSV.
np.shape(df1)

(12261, 9)

In [8]:
#Verificar con otra formula el total de filas y columnas del archivo CSV.
df1.shape

(12261, 9)

In [9]:
#Se revisa la cantidad de datos faltantes en la base de datos con el fin de saber que informacion falta.
df1.isnull().sum()

Brand             0
Description       1
Price             0
Size              1
Volume            1
Classification    0
PurchasePrice     0
VendorNumber      0
VendorName        0
dtype: int64

In [10]:
# Mostrar todas las filas con valores faltantes, esta formula generaba una fila pendiente por informacion con respecto a la descripción, size y volumen.
df1[df1.isnull().any(axis=1)]

,Brand,Description,Price,Size,Volume,Classification,PurchasePrice,VendorNumber,VendorName
7915,4202,NaN,0.0,NaN,NaN,1,11.19,480,BACARDI USA INC

In [11]:
# Contar cuantas filas tienen datos faltante(Nos daba como resultado 1 fila)
df1.isnull().any(axis=1).sum()

np.int64(1)

In [12]:
# Revisión de valores duplicados df1 es tu DataFrame
duplicados = df1.duplicated().sum()

print(f"Total de filas duplicadas: {duplicados}")

Total de filas duplicadas: 0

In [13]:
# Eliminar las filas de datos faltantes (si son pocos datos)
df1 = df1.dropna()

In [14]:
#Revisamos nuevamente numero total de filas y columnas.
df1.shape

(12260, 9)

In [29]:
# Renombrar columnas
df1.columns = ["ProductoId", "NombreProducto", "Precio", "Tamano", "Volumen", "Clasificacion", "Costo", "ProveedorId", "NombreProveedor"]  # Modifica según sea necesario

In [30]:
# Mostrar las primeras filas del CSV
df1.head()

,ProductoId,NombreProducto,Precio,Tamano,Volumen,Clasificacion,Costo,ProveedorId,NombreProveedor
0,58,Gekkeikan Black & Gold Sake,12.99,750mL,750,1,9.28,8320,SHAW ROSS INT L IMP LTD
1,62,Herradura Silver Tequila,36.99,750mL,750,1,28.67,1128,BROWN-FORMAN CORP
2,63,Herradura Reposado Tequila,38.99,750mL,750,1,30.46,1128,BROWN-FORMAN CORP
3,72,No. 3 London Dry Gin,34.99,750mL,750,1,26.11,9165,ULTRA BEVERAGE COMPANY LLP
4,75,Three Olives Tomato Vodka,14.99,750mL,750,1,10.94,7245,PROXIMO SPIRITS INC.

In [31]:
# Guardamos el dataset revisado, a este dataset guardado se le elimino una fila con valores NaN y se guardo a un nuevo archivo csv para poder utilizarlo posteriormente.
df1.to_csv("Productos.csv",index=False)

## ETL archivo BegInvFINAL12312026

In [20]:
import pandas as pd
import numpy as np

In [21]:
# Ruta del archivo CSV (ajusta según la ubicación de tu archivo)
ruta_csv2 = r"C:\\Proyecto Final Henry\\DataBase\\BegInvFINAL12312016.csv"

In [22]:
# Cargar el CSV en un DataFrame de Pandas
df2 = pd.read_csv(ruta_csv2)

In [32]:
# Mostrar las primeras filas del CSV
df2.head()

,InventoryId,Store,City,Brand,Description,Size,onHand,Price,startDate
0,1_HARDERSFIELD_58,1,HARDERSFIELD,58,Gekkeikan Black & Gold Sake,750mL,8,12.99,2016-01-01
1,1_HARDERSFIELD_60,1,HARDERSFIELD,60,Canadian Club 1858 VAP,750mL,7,10.99,2016-01-01
2,1_HARDERSFIELD_62,1,HARDERSFIELD,62,Herradura Silver Tequila,750mL,6,36.99,2016-01-01
3,1_HARDERSFIELD_63,1,HARDERSFIELD,63,Herradura Reposado Tequila,750mL,3,38.99,2016-01-01
4,1_HARDERSFIELD_72,1,HARDERSFIELD,72,No. 3 London Dry Gin,750mL,6,34.99,2016-01-01

In [25]:
# Revision del total de filas y columnas del dataframe.
df2.shape

(206529, 9)

In [26]:
#Se revisa la cantidad de datos faltantes en la base de datos para continuar
df2.isnull().sum()

InventoryId    0
Store          0
City           0
Brand          0
Description    0
Size           0
onHand         0
Price          0
startDate      0
dtype: int64

In [27]:
# Contar cuantas filas tienen datos faltante:
df2.isnull().any(axis=1).sum()

np.int64(0)

In [28]:
# observar si existen valores duplicados para el Dataframe df2.
duplicados = df2.duplicated().sum()

print(f"Total de filas duplicadas: {duplicados}")

Total de filas duplicadas: 0

In [35]:
# Renombrar columnas
df2.columns = ["InventarioInicialId", "Tienda", "Ciudad", "ProductoId", "NombreProducto", "Tamano", "Cantidad", "Precio", "FechaInicio"]  # Modifica según sea necesario

In [36]:
# Mostrar las primeras filas del CSV
df2.head()

,InventarioInicialId,Tienda,Ciudad,ProductoId,NombreProducto,Tamano,Cantidad,Precio,FechaInicio
0,1_HARDERSFIELD_58,1,HARDERSFIELD,58,Gekkeikan Black & Gold Sake,750mL,8,12.99,2016-01-01
1,1_HARDERSFIELD_60,1,HARDERSFIELD,60,Canadian Club 1858 VAP,750mL,7,10.99,2016-01-01
2,1_HARDERSFIELD_62,1,HARDERSFIELD,62,Herradura Silver Tequila,750mL,6,36.99,2016-01-01
3,1_HARDERSFIELD_63,1,HARDERSFIELD,63,Herradura Reposado Tequila,750mL,3,38.99,2016-01-01
4,1_HARDERSFIELD_72,1,HARDERSFIELD,72,No. 3 London Dry Gin,750mL,6,34.99,2016-01-01

In [37]:
# Guardamos el dataset revisado, a este dataset guardado se le elimino una fila con valores NaN y se guardo a un nuevo archivo csv para poder utilizarlo posteriormente.
df2.to_csv("InventarioInicial.csv",index=False)

## ETL archivo EndInvFINAL12312026

In [38]:
import pandas as pd
import numpy as np

In [39]:
# Ruta del archivo CSV (ajusta según la ubicación de tu archivo)
ruta_csv3 = r"C:\\Proyecto Final Henry\\DataBase\\EndInvFINAL12312016.csv"

In [40]:
# Cargar el CSV en un DataFrame de Pandas
df3 = pd.read_csv(ruta_csv3)

In [41]:
# Mostrar las primeras filas del CSV
df3.head()

,InventoryId,Store,City,Brand,Description,Size,onHand,Price,endDate
0,1_HARDERSFIELD_58,1,HARDERSFIELD,58,Gekkeikan Black & Gold Sake,750mL,11,12.99,2016-12-31
1,1_HARDERSFIELD_62,1,HARDERSFIELD,62,Herradura Silver Tequila,750mL,7,36.99,2016-12-31
2,1_HARDERSFIELD_63,1,HARDERSFIELD,63,Herradura Reposado Tequila,750mL,7,38.99,2016-12-31
3,1_HARDERSFIELD_72,1,HARDERSFIELD,72,No. 3 London Dry Gin,750mL,4,34.99,2016-12-31
4,1_HARDERSFIELD_75,1,HARDERSFIELD,75,Three Olives Tomato Vodka,750mL,7,14.99,2016-12-31

In [42]:
# Observar el total de filas y columnas
df3.shape

(224489, 9)

In [43]:
#Se revisa la cantidad de datos faltantes en la base de datos para continuar
df3.isnull().sum()

InventoryId       0
Store             0
City           1284
Brand             0
Description       0
Size              0
onHand            0
Price             0
endDate           0
dtype: int64

In [44]:
# Contar cuantas filas tienen datos faltante:
df3.isnull().any(axis=1).sum()

np.int64(1284)

In [45]:
# Mostrar todas las filas con valores faltantes: 
df3[df3.isnull().any(axis=1)]

,InventoryId,Store,City,Brand,Description,Size,onHand,Price,endDate
113895,46__58,46,NaN,58,Gekkeikan Black & Gold Sake,750mL,0,12.99,2016-12-31
113896,46__62,46,NaN,62,Herradura Silver Tequila,750mL,0,36.99,2016-12-31
113897,46__63,46,NaN,63,Herradura Reposado Tequila,750mL,0,38.99,2016-12-31
113898,46__77,46,NaN,77,Three Olives Espresso Vodka,750mL,0,14.99,2016-12-31
113899,46__106,46,NaN,106,Mr Boston Peach Schnapps,Liter,0,4.49,2016-12-31
...,...,...,...,...,...,...,...,...,...
115174,46__46447,46,NaN,46447,Gascon Malbec Mendoza,750mL,0,10.99,2016-12-31
115175,46__46458,46,NaN,46458,Layer Cake Barosa Shiraz,750mL,0,15.99,2016-12-31
115176,46__46476,46,NaN,46476,Tilia Malbec Mendoza,750mL,0,9.99,2016-12-31
115177,46__46764,46,NaN,46764,Clayhouse Adobe Red Paso Rbl,750mL,0,11.99,2016-12-31
115178,46__46830,46,NaN,46830,Pacific Rim Sweet Rsl,750mL,0,8.99,2016-12-31

In [46]:
# Se revisa la data del archivo EndInvFINAL12312016 la cual no contiene 1284 registros para el store numero 46,
# este se compara en el otro archivo el de BegInvFINAL12312016 y se observa que City para el store 46 es TYWARDREATH y se procede a reemplazar.
df3['City'] = df3['City'].fillna("TYWARDREATH")

In [47]:
#Se revisa nuevamente la cantidad de datos faltantes en la base de datos, ya que se reemplazo City store 46 por el nombre encontrado en el otro archivo
df3.isnull().sum()

InventoryId    0
Store          0
City           0
Brand          0
Description    0
Size           0
onHand         0
Price          0
endDate        0
dtype: int64

In [48]:
# Ver valores duplicados df3 es tu DataFrame
duplicados = df3.duplicated().sum()

print(f"Total de filas duplicadas: {duplicados}")

Total de filas duplicadas: 0

In [49]:
# Supongamos que tu DataFrame es df3 y queremos conocer los valores de las ciudades del Reino Unido sin duplicados.
unique_values = df3['City'].unique()

print("Valores únicos en la columna 'City':")
print(unique_values)

Valores únicos en la columna 'City':
['HARDERSFIELD' 'ASHBORNE' 'HORNSEY' 'EANVERNESS' 'SUTTON' 'GOULCREST'
 'STANMORE' 'ALNERWICK' 'BLACKPOOL' 'CARDEND' 'LEESIDE' 'TARMSWORTH'
 'BROMWICH' 'WANBORNE' 'LUNDY' 'OLDHAM' 'FURNESS' 'WINTERVALE'
 'BREDWARDINE' 'BALERNO' 'SHARNWICK' 'ARBINGTON' 'PALPERROTH' 'CAERSHIRE'
 "KNIFE'S EDGE" 'MOUNTMEND' 'LARNWICK' 'AYLESBURY' 'CULCHETH' 'PITMERDEN'
 'HALIVAARA' 'LEWES' 'PAETHSMOUTH' 'EASTHALLOW' 'BULLMAR' 'BLACK HOLLOW'
 'WOLFORD' 'PORTHCRAWL' 'VERITAS' 'TYWARDREATH' "PELLA'S WISH" 'NORFOLK'
 'GARIGILL' 'ABERDEEN' 'GRAYCOTT' 'HILLFAR' 'GUTHRAM' 'DRY GULCH'
 "BEGGAR'S HOLE" 'LANTEGLOS' 'HARTLEPOOL' 'CLAETHORPES' 'IRRAGIN'
 'AETHELNEY' 'KILMARNOCK' 'SWORDBREAK' 'CESTERFIELD' 'LUTON' 'SOLARIS'
 'KELD' 'CLARCTON' 'DONCASTER' 'PAENTMARWY' 'BARNCOMBE' 'TAMWORTH'
 'EASTHAVEN' 'BALLYMENA' 'PEMBROKE']

In [50]:
# Renombrar columnas
df3.columns = ["InventarioFinalId", "Tienda", "Ciudad", "ProductoId", "NombreProducto", "Tamano", "Cantidad", "Precio", "FechaFin"]  # Modifica según sea necesario

In [51]:
# Mostrar las primeras filas del CSV
df3.head()

,InventarioFinalId,Tienda,Ciudad,ProductoId,NombreProducto,Tamano,Cantidad,Precio,FechaFin
0,1_HARDERSFIELD_58,1,HARDERSFIELD,58,Gekkeikan Black & Gold Sake,750mL,11,12.99,2016-12-31
1,1_HARDERSFIELD_62,1,HARDERSFIELD,62,Herradura Silver Tequila,750mL,7,36.99,2016-12-31
2,1_HARDERSFIELD_63,1,HARDERSFIELD,63,Herradura Reposado Tequila,750mL,7,38.99,2016-12-31
3,1_HARDERSFIELD_72,1,HARDERSFIELD,72,No. 3 London Dry Gin,750mL,4,34.99,2016-12-31
4,1_HARDERSFIELD_75,1,HARDERSFIELD,75,Three Olives Tomato Vodka,750mL,7,14.99,2016-12-31

In [52]:
# Guardamos el dataset revisado, a este dataset guardado se le elimino una fila con valores NaN y se guardo a un nuevo archivo csv para poder utilizarlo posteriormente.
df3.to_csv("InventarioFinal.csv",index=False)

## ETL archivo InvoicePurchases12312016

In [53]:
import pandas as pd
import numpy as np

In [54]:
# Ruta del archivo CSV (ajusta según la ubicación de tu archivo)
ruta_csv4 = r"C:\\Proyecto Final Henry\\DataBase\\InvoicePurchases12312016.csv"

In [55]:
# Cargar el CSV en un DataFrame de Pandas
df4 = pd.read_csv(ruta_csv4)

In [56]:
# Mostrar las primeras filas del CSV
df4.head()

,VendorNumber,VendorName,InvoiceDate,PONumber,PODate,PayDate,Quantity,Dollars,Freight,Approval
0,105,ALTAMAR BRANDS LLC,2016-01-04,8124,2015-12-21,2016-02-16,6,214.26,3.47,NaN
1,4466,AMERICAN VINTAGE BEVERAGE,2016-01-07,8137,2015-12-22,2016-02-21,15,140.55,8.57,NaN
2,388,ATLANTIC IMPORTING COMPANY,2016-01-09,8169,2015-12-24,2016-02-16,5,106.60,4.61,NaN
3,480,BACARDI USA INC,2016-01-12,8106,2015-12-20,2016-02-05,10100,137483.78,2935.20,NaN
4,516,BANFI PRODUCTS CORP,2016-01-07,8170,2015-12-24,2016-02-12,1935,15527.25,429.20,NaN

In [57]:
# Mostrar el total de filas y columnas
df4.shape

(5543, 10)

In [58]:
#Se revisa la cantidad de datos faltantes en la base de datos para continuar
df4.isnull().sum()

VendorNumber       0
VendorName         0
InvoiceDate        0
PONumber           0
PODate             0
PayDate            0
Quantity           0
Dollars            0
Freight            0
Approval        5169
dtype: int64

In [59]:
# Mostrar todas las filas con valores faltantes: 
df4[df4.isnull().any(axis=1)]

,VendorNumber,VendorName,InvoiceDate,PONumber,PODate,PayDate,Quantity,Dollars,Freight,Approval
0,105,ALTAMAR BRANDS LLC,2016-01-04,8124,2015-12-21,2016-02-16,6,214.26,3.47,NaN
1,4466,AMERICAN VINTAGE BEVERAGE,2016-01-07,8137,2015-12-22,2016-02-21,15,140.55,8.57,NaN
2,388,ATLANTIC IMPORTING COMPANY,2016-01-09,8169,2015-12-24,2016-02-16,5,106.60,4.61,NaN
3,480,BACARDI USA INC,2016-01-12,8106,2015-12-20,2016-02-05,10100,137483.78,2935.20,NaN
4,516,BANFI PRODUCTS CORP,2016-01-07,8170,2015-12-24,2016-02-12,1935,15527.25,429.20,NaN
...,...,...,...,...,...,...,...,...,...,...
5538,9622,WEIN BAUER INC,2017-01-06,13626,2016-12-21,2017-02-10,90,1563.00,8.60,NaN
5539,9625,WESTERN SPIRITS BEVERAGE CO,2017-01-10,13661,2016-12-23,2017-02-18,4617,37300.48,186.50,NaN
5540,3664,WILLIAM GRANT & SONS INC,2017-01-02,13643,2016-12-22,2017-02-04,9848,202815.78,932.95,NaN
5541,9815,WINE GROUP INC,2017-01-03,13602,2016-12-20,2017-02-08,24747,149007.56,819.54,NaN
5542,90058,ZORVINO VINEYARDS,2017-01-05,13574,2016-12-18,2017-02-12,437,3608.11,16.60,NaN

In [60]:
# Contar cuantas filas tienen datos faltante:
df4.isnull().any(axis=1).sum()

np.int64(5169)

In [62]:
# Ver valores duplicados df4 es tu DataFrame
duplicados = df4.duplicated().sum()

print(f"Total de filas duplicadas: {duplicados}")

Total de filas duplicadas: 0

In [63]:
# Revisar que tipo de dato es Approval
print(df4['Approval'].dtype)

object

In [64]:
# Supongamos que tu DataFrame es df4, aca podemos ver los valores sin duplicados asociados a la columna Approval.
unique_values = df4['Approval'].unique()

print("Valores únicos en la columna 'Approval':")
print(unique_values)

Valores únicos en la columna 'Approval':
[nan 'Frank Delahunt']

In [65]:
# Eliminar la columna Approval ya que no aporta mayor informacion a el archivo.
df4 = df4.drop(columns=["Approval"])

In [66]:
#Se revisa nuevamente la cantidad de datos faltantes en la base de datos para continuar
df4.isnull().sum()

VendorNumber    0
VendorName      0
InvoiceDate     0
PONumber        0
PODate          0
PayDate         0
Quantity        0
Dollars         0
Freight         0
dtype: int64

In [67]:
# Mostrar el total de filas y columnas, observando que el archivo quedo con 9 columnas.
df4.shape

(5543, 9)

In [68]:
# Renombrar columnas
df4.columns = ["ProveedorId", "NombreProveedor", "FechaFactura", "CompraId", "FechaCompra", "FechaPago", "Cantidad", "CostoTotal", "CostoEnvio"]  # Modifica según sea necesario

In [70]:
# Mostrar las primeras filas del CSV
df4.head()

,ProveedorId,NombreProveedor,FechaFactura,CompraId,FechaCompra,FechaPago,Cantidad,CostoTotal,CostoEnvio
0,105,ALTAMAR BRANDS LLC,2016-01-04,8124,2015-12-21,2016-02-16,6,214.26,3.47
1,4466,AMERICAN VINTAGE BEVERAGE,2016-01-07,8137,2015-12-22,2016-02-21,15,140.55,8.57
2,388,ATLANTIC IMPORTING COMPANY,2016-01-09,8169,2015-12-24,2016-02-16,5,106.60,4.61
3,480,BACARDI USA INC,2016-01-12,8106,2015-12-20,2016-02-05,10100,137483.78,2935.20
4,516,BANFI PRODUCTS CORP,2016-01-07,8170,2015-12-24,2016-02-12,1935,15527.25,429.20

In [71]:
# Guardamos el dataset revisado, a este dataset guardado se le elimino una fila con valores NaN y se guardo a un nuevo archivo csv para poder utilizarlo posteriormente.
df4.to_csv("Compras.csv",index=False)

## ETL archivo PurchasesFINAL12312016

In [72]:
import pandas as pd
import numpy as np

In [73]:
# Ruta del archivo CSV (ajusta según la ubicación de tu archivo)
ruta_csv5 = r"C:\\Proyecto Final Henry\\DataBase\\PurchasesFINAL12312016.csv"

In [74]:
# Cargar el CSV en un DataFrame de Pandas
df5 = pd.read_csv(ruta_csv5)

In [75]:
# Mostrar las primeras filas del CSV
df5.head()

,InventoryId,Store,Brand,Description,Size,VendorNumber,VendorName,PONumber,PODate,ReceivingDate,InvoiceDate,PayDate,PurchasePrice,Quantity,Dollars,Classification
0,69_MOUNTMEND_8412,69,8412,Tequila Ocho Plata Fresno,750mL,105,ALTAMAR BRANDS LLC,8124,2015-12-21,2016-01-02,2016-01-04,2016-02-16,35.71,6,214.26,1
1,30_CULCHETH_5255,30,5255,TGI Fridays Ultimte Mudslide,1.75L,4466,AMERICAN VINTAGE BEVERAGE,8137,2015-12-22,2016-01-01,2016-01-07,2016-02-21,9.35,4,37.40,1
2,34_PITMERDEN_5215,34,5215,TGI Fridays Long Island Iced,1.75L,4466,AMERICAN VINTAGE BEVERAGE,8137,2015-12-22,2016-01-02,2016-01-07,2016-02-21,9.41,5,47.05,1
3,1_HARDERSFIELD_5255,1,5255,TGI Fridays Ultimte Mudslide,1.75L,4466,AMERICAN VINTAGE BEVERAGE,8137,2015-12-22,2016-01-01,2016-01-07,2016-02-21,9.35,6,56.10,1
4,76_DONCASTER_2034,76,2034,Glendalough Double Barrel,750mL,388,ATLANTIC IMPORTING COMPANY,8169,2015-12-24,2016-01-02,2016-01-09,2016-02-16,21.32,5,106.60,1

In [76]:
# Mostrar el total de filas y columnas
df5.shape

(2372474, 16)

In [77]:
#Se revisa la cantidad de datos faltantes en la base de datos para continuar
df5.isnull().sum()

InventoryId       0
Store             0
Brand             0
Description       0
Size              3
VendorNumber      0
VendorName        0
PONumber          0
PODate            0
ReceivingDate     0
InvoiceDate       0
PayDate           0
PurchasePrice     0
Quantity          0
Dollars           0
Classification    0
dtype: int64

In [78]:
# Mostrar todas las filas con valores faltantes: 
df5[df5.isnull().any(axis=1)]

,InventoryId,Store,Brand,Description,Size,VendorNumber,VendorName,PONumber,PODate,ReceivingDate,InvoiceDate,PayDate,PurchasePrice,Quantity,Dollars,Classification
1109668,34_PITMERDEN_3121,34,3121,Pinnacle Rainbow Sherbet,NaN,12546,JIM BEAM BRANDS COMPANY,10938,2016-06-27,2016-07-04,2016-07-13,2016-08-16,6.93,7,48.51,1
1112426,34_PITMERDEN_5678,34,5678,Skinnygirl Pina Colada,NaN,12546,JIM BEAM BRANDS COMPANY,10938,2016-06-27,2016-07-09,2016-07-13,2016-08-16,6.93,6,41.58,1
1116302,39_EASTHALLOW_15365,39,15365,Alabaster 07 Tinta de Toro,NaN,9552,M S WALKER INC,10972,2016-06-29,2016-07-07,2016-07-13,2016-08-21,91.83,1,91.83,2

In [79]:
# Contar cuantas filas tienen datos faltante:
df5.isnull().any(axis=1).sum()

np.int64(3)

In [80]:
# Eliminar las filas de datos faltantes (Para este caso se eliminaran un total de 3 filas)
df5 = df5.dropna()

In [81]:
# Mostrar el total de filas y columnas
df5.shape

(2372471, 16)

In [82]:
# Ver valores duplicados df5 es tu DataFrame
duplicados = df5.duplicated().sum()

print(f"Total de filas duplicadas: {duplicados}")

Total de filas duplicadas: 0

In [83]:
# Renombrar columnas
df5.columns = ["InventarioIncialId", "Tienda", "ProductoId", "NombreProducto", "Tamano", "ProveedorId", "NombreProveedor", "CompraId", "FechaCompra", "FechaIngreso", "FechaFactura", "FechaPago", "CostoUnitario", "Cantidad", "CostoTotal", "Clasificacion"]  # Modifica según sea necesario

In [84]:
# Mostrar las primeras filas del CSV
df5.head()

,InventarioIncialId,Tienda,ProductoId,NombreProducto,Tamano,ProveedorId,NombreProveedor,CompraId,FechaCompra,FechaIngreso,FechaFactura,FechaPago,CostoUnitario,Cantidad,CostoTotal,Clasificacion
0,69_MOUNTMEND_8412,69,8412,Tequila Ocho Plata Fresno,750mL,105,ALTAMAR BRANDS LLC,8124,2015-12-21,2016-01-02,2016-01-04,2016-02-16,35.71,6,214.26,1
1,30_CULCHETH_5255,30,5255,TGI Fridays Ultimte Mudslide,1.75L,4466,AMERICAN VINTAGE BEVERAGE,8137,2015-12-22,2016-01-01,2016-01-07,2016-02-21,9.35,4,37.40,1
2,34_PITMERDEN_5215,34,5215,TGI Fridays Long Island Iced,1.75L,4466,AMERICAN VINTAGE BEVERAGE,8137,2015-12-22,2016-01-02,2016-01-07,2016-02-21,9.41,5,47.05,1
3,1_HARDERSFIELD_5255,1,5255,TGI Fridays Ultimte Mudslide,1.75L,4466,AMERICAN VINTAGE BEVERAGE,8137,2015-12-22,2016-01-01,2016-01-07,2016-02-21,9.35,6,56.10,1
4,76_DONCASTER_2034,76,2034,Glendalough Double Barrel,750mL,388,ATLANTIC IMPORTING COMPANY,8169,2015-12-24,2016-01-02,2016-01-09,2016-02-16,21.32,5,106.60,1

In [85]:
# Guardamos el dataset revisado, a el cual se le elimino una fila convalores NaN y se guarda a un nuevo archivo csv para poderlo utilizar posteriormente.
df5.to_csv("DetalleCompra.csv",index=False)

In [87]:
# Supongamos que tu DataFrame es df4, aca podemos ver los valores sin duplicados asociados a la columna Approval.
unique_values1 = df5['ProductoId'].unique()

print("Valores únicos en la columna 'ProductoId':")
print(unique_values1)

Valores únicos en la columna 'ProductoId':
[ 8412  5255  5215 ...  1073  1071 27051]

In [89]:
num_unique_brands = df5['ProductoId'].nunique()
print(num_unique_brands)

10663

## ETL archivo SalesFINAL12312016

In [90]:
import pandas as pd
import numpy as np

In [91]:
# Ruta del archivo CSV (ajusta según la ubicación de tu archivo)
ruta_csv6 = r"C:\\Proyecto Final Henry\\DataBase\\SalesFINAL12312016.csv"

In [92]:
# Cargar el CSV en un DataFrame de Pandas
df6 = pd.read_csv(ruta_csv6)

In [93]:
# Mostrar las primeras filas del CSV
df6.head()

,InventoryId,Store,Brand,Description,Size,SalesQuantity,SalesDollars,SalesPrice,SalesDate,Volume,Classification,ExciseTax,VendorNo,VendorName
0,1_HARDERSFIELD_1004,1,1004,Jim Beam w/2 Rocks Glasses,750mL,1,16.49,16.49,1/1/2016,750,1,0.79,12546,JIM BEAM BRANDS COMPANY
1,1_HARDERSFIELD_1004,1,1004,Jim Beam w/2 Rocks Glasses,750mL,2,32.98,16.49,1/2/2016,750,1,1.57,12546,JIM BEAM BRANDS COMPANY
2,1_HARDERSFIELD_1004,1,1004,Jim Beam w/2 Rocks Glasses,750mL,1,16.49,16.49,1/3/2016,750,1,0.79,12546,JIM BEAM BRANDS COMPANY
3,1_HARDERSFIELD_1004,1,1004,Jim Beam w/2 Rocks Glasses,750mL,1,14.49,14.49,1/8/2016,750,1,0.79,12546,JIM BEAM BRANDS COMPANY
4,1_HARDERSFIELD_1005,1,1005,Maker's Mark Combo Pack,375mL 2 Pk,2,69.98,34.99,1/9/2016,375,1,0.79,12546,JIM BEAM BRANDS COMPANY

In [94]:
# Mostrar el total de filas y columnas
df6.shape

(1048575, 14)

In [95]:
#Se revisa la cantidad de datos faltantes en la base de datos para continuar
df6.isnull().sum()

InventoryId       0
Store             0
Brand             0
Description       0
Size              0
SalesQuantity     0
SalesDollars      0
SalesPrice        0
SalesDate         0
Volume            0
Classification    0
ExciseTax         0
VendorNo          0
VendorName        0
dtype: int64

In [96]:
# Mostrar todas las filas con valores faltantes: 
df6[df6.isnull().any(axis=1)]

Empty DataFrame
Columns: [InventoryId, Store, Brand, Description, Size, SalesQuantity, SalesDollars, SalesPrice, SalesDate, Volume, Classification, ExciseTax, VendorNo, VendorName]
Index: []

In [97]:
# Ver valores duplicados df6 es tu DataFrame
duplicados = df6.duplicated().sum()

print(f"Total de filas duplicadas: {duplicados}")

Total de filas duplicadas: 0

In [98]:
# Renombrar columnas
df6.columns = ["InventarioIncialId", "Tienda", "ProductoId", "NombreProducto", "Tamano", "CantidadVendida", "TotalVenta", "PrecioUnitario", "FechaVenta", "Volumen", "Clasificacion", "Impuestos", "ProveedorId", "NombreProveedor"]  # Modifica según sea necesario

In [99]:
# Mostrar las primeras filas del CSV
df6.head()

,InventarioIncialId,Tienda,ProductoId,NombreProducto,Tamano,CantidadVendida,TotalVenta,PrecioUnitario,FechaVenta,Volumen,Clasificacion,Impuestos,ProveedorId,NombreProveedor
0,1_HARDERSFIELD_1004,1,1004,Jim Beam w/2 Rocks Glasses,750mL,1,16.49,16.49,1/1/2016,750,1,0.79,12546,JIM BEAM BRANDS COMPANY
1,1_HARDERSFIELD_1004,1,1004,Jim Beam w/2 Rocks Glasses,750mL,2,32.98,16.49,1/2/2016,750,1,1.57,12546,JIM BEAM BRANDS COMPANY
2,1_HARDERSFIELD_1004,1,1004,Jim Beam w/2 Rocks Glasses,750mL,1,16.49,16.49,1/3/2016,750,1,0.79,12546,JIM BEAM BRANDS COMPANY
3,1_HARDERSFIELD_1004,1,1004,Jim Beam w/2 Rocks Glasses,750mL,1,14.49,14.49,1/8/2016,750,1,0.79,12546,JIM BEAM BRANDS COMPANY
4,1_HARDERSFIELD_1005,1,1005,Maker's Mark Combo Pack,375mL 2 Pk,2,69.98,34.99,1/9/2016,375,1,0.79,12546,JIM BEAM BRANDS COMPANY

In [100]:
# Guardamos el dataset revisado, a este dataset guardado se le elimino una fila con valores NaN y se guardo a un nuevo archivo csv para poder utilizarlo posteriormente.
df6.to_csv("Ventas.csv",index=False)